IDEA StatiCa Open Model
ConnectionLoadInfo Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Information about connection load update
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.ConnectionLoadInfo
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
[SerializableAttribute]
public class ConnectionLoadInfo
<SerializableAttribute>
Public Class ConnectionLoadInfo
[SerializableAttribute]
public ref class ConnectionLoadInfo
The ConnectionLoadInfo type exposes the following members.
Constructors
Name | Description
ConnectionLoadInfo
Initializes a new instance of the ConnectionLoadInfo class
Top
Properties
Name | Description
BeamMapping
 BeamMapping
Description
 Name of Weld
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace